{"version":"0.0.1","changelog":"<!DOCTYPE html><html lang="en"><head> <meta charset="UTF-8"> <meta name="viewport" content="width=device-width, initial-scale=1.0"> <title>Podify App Change Log</title></head><body> <h2>Version v0.0.1 (First Official Release)</h2> <h3>Features:</h3> <ul> <li>Efficient organization of local audio files into a user-friendly library.</li> <li>Tracking of playback history to keep record of listened audio.</li> <li>Lightweight design, ensuring the app won't burden your device.</li> <li>Adherence to Material 3 design standards, providing a sleek and intuitive interface.</li> <li>Compatibility with Android version 6 and above.</li> </ul> <h3>Permissions:</h3> <ul> <li>Storage Access: Required for accessing the phone's storage for local audio files.</li> <li>Notification Permission: Needed for displaying notifications.</li> </ul> <h3>Enhancements:</h3> <ul> <li>This marks the first official release of Podify.</li> <li>The app may contain bugs, issues, and shortcomings in its initial version.</li> <li>Users are encouraged to provide feedback, share opinions, suggest enhancements, and report issues on our <a href="https://github.com/Kys0me/Podify-Download-Page/issues">GitHub Issues</a> page.</li> </ul> <h3>Additional Features (Not Yet Implemented):</h3> <ul> <li>Background Operation: The app is planned to continue working in the background even after being removed from the taskbar.</li> <li>Online Audio Browsing: A feature to browse and discover online audio content is in the works.</li> <li>Notification Compatibility: Notifications may not appear for users with Android versions below 8. This will be addressed in future updates.</li> </ul> <p><em>Note: This change log reflects the features and state of the app as of version v0.0.1.</em></p></body></html>","fullChangelogLink":"https://github.com/Kys0me/Podify-Download-Page/releases","downloadLink":"https://github.com/Kys0me/Podify-Download-Page/releases/download/v0.0.1/app-release.apk","requiredAt":"0"}
